Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: وليحكم أهل الإنجيل بما أنزل الله فيه ومن لم يحكم بما أنزل الله فأولئك هم الفاسقون
en: Let the people of the Injeel (Gospel) judge by what Allah has revealed therein. And whosoever does not judge by what Allah has revealed (then) such (people) are the Fasiqun [the rebellious i.e. disobedient (of a lesser degree)] to Allah.

source: وأنزلنا إليك الكتاب بالحق مصدقا لما بين يديه من الكتاب ومهيمنا عليه فاحكم بينهم بما أنزل الله ولا تتبع أهواءهم عما جاءك من الحق لكل جعلنا منكم شرعة ومنهاجا ولو شاء الله لجعلكم أمة واحدة ولكن ليبلوكم في ما آتاكم فاستبقوا الخيرات إلى الله مرجعكم جميعا فينبئكم بما كنتم فيه تختلفون
en: And We have sent down to you (O Muhammad صلى الله عليه وسلم) the Book (this Qur'an) in truth, confirming the Scripture that came before it and Muhaymin (trustworthy in highness and a witness) over it (old Scriptures) . So judge among them by what Allah has revealed, and follow not their vain desires, diverging away from the truth that has come to you. To each among you, We have prescribed a law and a clear way. If Allah had willed, He would have made you one nation, but that (He) may test you in what He has given you; so compete in good deeds. The return of you (all) is to Allah; then He will inform you about that in which you used to differ.

source: وأن احكم بينهم بما أنزل الله ولا تتبع أهواءهم واحذرهم أن يفتنوك عن بعض ما أنزل الله إليك فإن تولوا فاعلم أنما يريد الله أن يصيبهم ببعض ذنوبهم وإن كثيرا من الناس لفاسقون
en: And so judge (you O Muhammad صلى الله عليه وسلم) among them by what Allah has revealed and follow not their vain desires, but beware of them lest they turn you (O Muhammad صلى الله عليه وسلم) far away from some of that which Allah has sent down to you. And if they turn away, then know that Allah's Will is to punish them for some sins of theirs. And truly, most of men are Fasiqun (rebellious and disobedient to Allah).

source: أفحكم الجاهلية يبغون ومن أحسن من الله حكما لقوم يوقنون
en: Do they then seek the judgement of (the days of) Ignorance? And who is better in judgement than Allah for a people who have firm Faith.

source: يا أيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء بعضهم أولياء بعض ومن يتولهم منكم فإنه منهم إن الله لا يهدي القوم الظالمين
en: O you who believe! Take not the Jews and the Christians as Auliya' (friends, protectors, helpers), they are but Auliya' of each other. And if any amongst you takes them (as Auliya'), then surely he is one of them. Verily, Allah guides not those people who are the Zalimun (polytheists and wrong-doers and unjust).

source: فترى الذين في قلوبهم مرض يسارعون فيهم يقولون نخشى أن تصيبنا دائرة فعسى الله أن يأتي بالفتح أو أمر من عنده فيصبحوا على ما أسروا في أنفسهم نادمين
en: And you see those in whose hearts there is a disease (of hypocrisy), they hurry to their friendship, saying: "We fear lest some misfortune of a disaster may befall us." Perhaps Allah may bring a victory or a decision according to His Will. Then they will become regretful for what they have been keeping as a secret in themselves.

source: ويقول الذين آمنوا أهؤلاء الذين أقسموا بالله جهد أيمانهم إنهم لمعكم حبطت أعمالهم فأصبحوا خاسرين
en: And those who believe will say: "Are these the men (hypocrites) who swore their strongest oaths by Allah that they were with you (Muslims)?" All that they did has been in vain (because of their hypocrisy), and they have become the losers.

source: يا أيها الذين آمنوا من يرتد منكم عن دينه فسوف يأتي الله بقوم يحبهم ويحبونه أذلة على المؤمنين أعزة على الكافرين يجاهدون في سبيل الله ولا يخافون لومة لائم ذلك فضل الله يؤتيه من يشاء والله واسع عليم
en: O you who believe! Whoever from among you turns back from his religion (Islam), Allah will bring a people whom He will love and they will love Him; humble towards the believers, stern towards the disbelievers, fighting in the Way of Allah, and never fear of the blame of the blamers. That is the Grace of Allah which He bestows on whom He wills. And Allah is All-Sufficient for His creatures' needs, All-Knower.

source: إنما وليكم الله ورسوله والذين آمنوا الذين يقيمون الصلاة ويؤتون الزكاة وهم راكعون
en: Verily, your Wali (Protector or Helper) is none other than Allah, His Messenger, and the believers, - those who perform As-Salat (Iqamat-as-Salat), and give Zakat, and they are Raki'un (those who bow down or submit themselves with obedience to Allah in prayer).

source: ومن يتول الله ورسوله والذين آمنوا فإن حزب الله هم الغالبون
en: And whosoever takes Allah, His Messenger, and those who have believed, as Protectors, then the party of Allah will be the victorious.

source: يا أيها الذين آمنوا لا تتخذوا الذين اتخذوا دينكم هزوا ولعبا من الذين أوتوا الكتاب من قبلكم والكفار أولياء واتقوا الله إن كنتم مؤمنين
en: O you who believe! Take not as Auliya' (protectors and helpers) those who take your religion as a mockery and fun from among those who received the Scripture (Jews and Christians) before you, and nor from among the disbelievers; and fear Allah if you indeed are true believers.

source: وإذا ناديتم إلى الصلاة اتخذوها هزوا ولعبا ذلك بأنهم قوم لا يعقلون
en: And when you proclaim the call for As-Salat [call for the prayer (Adhan )], they take it (but) as a mockery and fun; that is because they are a people who understand not.

source: قل يا أهل الكتاب هل تنقمون منا إلا أن آمنا بالله وما أنزل إلينا وما أنزل من قبل وأن أكثركم فاسقون
en: Say: "O people of the Scripture (Jews and Christians)! Do you criticize us for no other reason than that we believe in Allah, and in (the revelation) which has been sent down to us and in that which has been sent down before (us), and that most of you are Fasiqun [rebellious and disobedient (to Allah)]?"

source: قل هل أنبئكم بشر من ذلك مثوبة عند الله من لعنه الله وغضب عليه وجعل منهم القردة والخنازير وعبد الطاغوت أولئك شر مكانا وأضل عن سواء السبيل
en: Say (O Muhammad صلى الله عليه وسلم to the people of the Scripture): "Shall I inform you of something worse than that, regarding the recompense from Allah: those (Jews) who incurred the Curse of Allah and His Wrath, and those of whom (some) He transformed into monkeys and swines, and those who worshipped Taghut (false deities); such are worse in rank (on the Day of Resurrection in the Hell-fire), and far more astray from the Right Path (in the life of this world)."

source: وإذا جاءوكم قالوا آمنا وقد دخلوا بالكفر وهم قد خرجوا به والله أعلم بما كانوا يكتمون
en: When they come to you, they say: "We believe." But in fact they enter with (an intention of) disbelief and they go out with the same. And Allah knows all what they were hiding.

source: وترى كثيرا منهم يسارعون في الإثم والعدوان وأكلهم السحت لبئس ما كانوا يعملون
en: And you see many of them (Jews) hurrying towards sin and transgression, and eating illegal things [as bribes and Riba (usury)]. Evil indeed is that which they have been doing.

source: لولا ينهاهم الربانيون والأحبار عن قولهم الإثم وأكلهم السحت لبئس ما كانوا يصنعون
en: Why do not the rabbis and the religious learned men forbid them from uttering sinful words and from eating illegal things. Evil indeed is that which they have been performing.

source: وقالت اليهود يد الله مغلولة غلت أيديهم ولعنوا بما قالوا بل يداه مبسوطتان ينفق كيف يشاء وليزيدن كثيرا منهم ما أنزل إليك من ربك طغيانا وكفرا وألقينا بينهم العداوة والبغضاء إلى يوم القيامة كلما أوقدوا نارا للحرب أطفأها الله ويسعون في الأرض فسادا والله لا يحب المفسدين
en: The Jews say: "Allah's Hand is tied up (i.e. He does not give and spend of His Bounty)." Be their hands tied up and be they accursed for what they uttered. Nay, both His Hands are widely outstretched. He spends (of His Bounty) as He wills. Verily, the Revelation that has come to you from your Lord (Allah) increases in most of them (their) obstinate rebellion and disbelief. We have put enmity and hatred amongst them till the Day of Resurrection. Every time they kindled the fire of war, Allah extinguished it; and they (ever) strive to make mischief on the earth. And Allah does not like the Mufsidun (mischief-makers).

source: ولو أن أهل الكتاب آمنوا واتقوا لكفرنا عنهم سيئاتهم ولأدخلناهم جنات النعيم
en: And if only the people of the Scripture (Jews and Christians) had believed (in Muhammad صلى الله عليه وسلم) and warded off evil (sin, ascribing partners to Allah) and had become Al-Muttaqun (the pious - See V.2:2) We would indeed have expiated from them their sins and admitted them to Gardens of pleasure (in Paradise).

source: ولو أنهم أقاموا التوراة والإنجيل وما أنزل إليهم من ربهم لأكلوا من فوقهم ومن تحت أرجلهم منهم أمة مقتصدة وكثير منهم ساء ما يعملون
en: And if only they had acted according to the Taurat (Torah), the Injeel (Gospel), and what has (now) been sent down to them from their Lord (the Qur'an), they would surely have gotten provision from above them and from underneath their feet. There are from among them people who are on the right course (i.e. they act on the revelation and believe in Prophet Muhammad صلى الله عليه وسلم as 'Abdullah bin Salam رضي الله عنه), but many of them do evil deeds.

source: يا أيها الرسول بلغ ما أنزل إليك من ربك وإن لم تفعل فما بلغت رسالته والله يعصمك من الناس إن الله لا يهدي القوم الكافرين
en: O Messenger (Muhammad صلى الله عليه وسلم)! Proclaim (the Message) which has been sent down to you from your Lord. And if you do not, then you have not conveyed His Message. Allah will protect you from mankind. Verily, Allah guides not the people who disbelieve.

source: قل يا أهل الكتاب لستم على شيء حتى تقيموا التوراة والإنجيل وما أنزل إليكم من ربكم وليزيدن كثيرا منهم ما أنزل إليك من ربك طغيانا وكفرا فلا تأس على القوم الكافرين
en: Say (O Muhammad صلى الله عليه وسلم) "O people of the Scripture (Jews and Christians)! You have nothing (as regards guidance) till you act according to the Taurat (Torah), the Injeel (Gospel), and what has (now) been sent down to you from your Lord (the Qur'an)." Verily, that which has been sent down to you (Muhammad صلى الله عليه وسلم) from your Lord increases in most of them (their) obstinate rebellion and disbelief. So be not sorrowful over the people who disbelieve.

source: إن الذين آمنوا والذين هادوا والصابئون والنصارى من آمن بالله واليوم الآخر وعمل صالحا فلا خوف عليهم ولا هم يحزنون
en: Surely, those who believe (in the Oneness of Allah, in His Messenger Muhammad صلى الله عليه وسلم and all that was revealed to him from Allah), and those who are the Jews and the Sabians and the Christians, - whosoever believed in Allah and the Last Day, and worked righteousness, on them shall be no fear, nor shall they grieve.

source: لقد أخذنا ميثاق بني إسرائيل وأرسلنا إليهم رسلا كلما جاءهم رسول بما لا تهوى أنفسهم فريقا كذبوا وفريقا يقتلون
en: Verily, We took the covenant of the Children of Israel and sent Messengers to them. Whenever there came to them a Messenger with what they themselves desired not, - a group of them they called liars, and others among them they killed.

source: وحسبوا ألا تكون فتنة فعموا وصموا ثم تاب الله عليهم ثم عموا وصموا كثير منهم والله بصير بما يعملون
en: They thought there will be no Fitnah (trial or punishment), so they became blind and deaf; after that Allah turned to them (with Forgiveness); yet again many of them became blind and deaf. And Allah is the All-Seer of what they do.

source: لقد كفر الذين قالوا إن الله هو المسيح ابن مريم وقال المسيح يا بني إسرائيل اعبدوا الله ربي وربكم إنه من يشرك بالله فقد حرم الله عليه الجنة ومأواه النار وما للظالمين من أنصار
en: Surely, they have disbelieved who say: "Allah is the Messiah ['Îsa (Jesus)], son of Maryam (Mary)." But the Messiah ['Îsa (Jesus)] said: "O Children of Israel! Worship Allah, my Lord and your Lord." Verily, whosoever sets up partners (in worship) with Allah, then Allah has forbidden Paradise to him, and the Fire will be his abode . And for the Zalimun (polytheists and wrong-doers) there are no helpers.

source: لقد كفر الذين قالوا إن الله ثالث ثلاثة وما من إله إلا إله واحد وإن لم ينتهوا عما يقولون ليمسن الذين كفروا منهم عذاب أليم
en: Surely, disbelievers are those who said: "Allah is the third of the three (in a Trinity)." But there is no Ilah (god) (none who has the right to be worshipped) but One Ilah (God -Allah). And if they cease not from what they say, verily, a painful torment will befall on the disbelievers among them.

source: أفلا يتوبون إلى الله ويستغفرونه والله غفور رحيم
en: Will they not turn with repentance to Allah and ask His Forgiveness? For Allah is Oft-Forgiving, Most Merciful.

source: ما المسيح ابن مريم إلا رسول قد خلت من قبله الرسل وأمه صديقة كانا يأكلان الطعام انظر كيف نبين لهم الآيات ثم انظر أنى يؤفكون
en: The Messiah ['Îsa (Jesus)], son of Maryam (Mary), was no more than a Messenger; many were the Messengers that passed away before him. His mother [Maryam (Mary)] was a Siddiqah [i.e. she believed in the Words of Allah and His Books (see Verse 66:12)]. They both used to eat food (as any other human being, while Allah does not eat). Look how We make the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) clear to them; yet look how they are deluded away (from the truth).

source: قل أتعبدون من دون الله ما لا يملك لكم ضرا ولا نفعا والله هو السميع العليم
en: Say (O Muhammad صلى الله عليه وسلم to mankind): "How do you worship besides Allah something which has no power either to harm or benefit you? But it is Allah Who is the All-Hearer, All-Knower."

source: قل يا أهل الكتاب لا تغلوا في دينكم غير الحق ولا تتبعوا أهواء قوم قد ضلوا من قبل وأضلوا كثيرا وضلوا عن سواء السبيل
en: Say (O Muhammad صلى الله عليه وسلم): "O people of the Scripture (Jews and Christians)! Exceed not the limits in your religion (by believing in something) other than the truth, and do not follow the vain desires of people who went astray before and who misled many, and strayed (themselves) from the Right Path."

source: لعن الذين كفروا من بني إسرائيل على لسان داوود وعيسى ابن مريم ذلك بما عصوا وكانوا يعتدون
en: Those among the Children of Israel who disbelieved were cursed by the tongue of Dawud (David) and 'Îsa (Jesus), son of Maryam (Mary). That was because they disobeyed (Allah and the Messengers) and were ever transgressing beyond bounds.

source: كانوا لا يتناهون عن منكر فعلوه لبئس ما كانوا يفعلون
en: They used not to forbid one another from Al-Munkar (wrong, evil-doing, sins, polytheism, disbelief) which they committed. Vile indeed was what they used to do.

source: ترى كثيرا منهم يتولون الذين كفروا لبئس ما قدمت لهم أنفسهم أن سخط الله عليهم وفي العذاب هم خالدون
en: You see many of them taking the disbelievers as their Auliya' (protectors and helpers). Evil indeed is that which their ownselves have sent forward before them; for that (reason) Allah's Wrath fell upon them, and in torment they will abide.

source: ولو كانوا يؤمنون بالله والنبي وما أنزل إليه ما اتخذوهم أولياء ولكن كثيرا منهم فاسقون
en: And had they believed in Allah, and in the Prophet (Muhammad صلى الله عليه وسلم) and in what has been revealed to him, never would they have taken them (the disbelievers) as Auliya' (protectors and helpers); but many of them are the Fasiqun (rebellious, disobedient to Allah).

source: لتجدن أشد الناس عداوة للذين آمنوا اليهود والذين أشركوا ولتجدن أقربهم مودة للذين آمنوا الذين قالوا إنا نصارى ذلك بأن منهم قسيسين ورهبانا وأنهم لا يستكبرون
en: Verily, you will find the strongest among men in enmity to the believers (Muslims) the Jews and those who are Al-Mushrikun and you will find the nearest in love to the believers (Muslims) those who say: "We are Christians." That is because amongst them are priests and monks, and they are not proud.

source: وإذا سمعوا ما أنزل إلى الرسول ترى أعينهم تفيض من الدمع مما عرفوا من الحق يقولون ربنا آمنا فاكتبنا مع الشاهدين
en: And when they (who call themselves Christians) listen to what has been sent down to the Messenger (Muhammad صلى الله عليه وسلم), you see their eyes overflowing with tears because of the truth they have recognised. They say: "Our Lord! We believe; so write us down among the witnesses.

source: وما لنا لا نؤمن بالله وما جاءنا من الحق ونطمع أن يدخلنا ربنا مع القوم الصالحين
en: "And why should we not believe in Allah and in that which has come to us of the truth (Islamic Monotheism)? And we wish that our Lord will admit us (in Paradise on the Day of Resurrection) along with the righteous people (Prophet Muhammad صلى الله عليه وسلم and his Companions رضي الله عنهم)."

source: فأثابهم الله بما قالوا جنات تجري من تحتها الأنهار خالدين فيها وذلك جزاء المحسنين
en: So because of what they said, Allah rewarded them Gardens under which rivers flow (in Paradise), they will abide therein forever. Such is the reward of Al-Muhsinun (the good-doers).

source: يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله لكم ولا تعتدوا إن الله لا يحب المعتدين
en: O you who believe! Make not unlawful the Tayyibat (all that is good as regards foods, things, deeds, beliefs, persons) which Allah has made lawful to you, and transgress not. Verily, Allah does not like the transgressors.

source: وكلوا مما رزقكم الله حلالا طيبا واتقوا الله الذي أنتم به مؤمنون
en: And eat of the things which Allah has provided for you, lawful and good, and fear Allah in Whom you believe.

source: لا يؤاخذكم الله باللغو في أيمانكم ولكن يؤاخذكم بما عقدتم الأيمان فكفارته إطعام عشرة مساكين من أوسط ما تطعمون أهليكم أو كسوتهم أو تحرير رقبة فمن لم يجد فصيام ثلاثة أيام ذلك كفارة أيمانكم إذا حلفتم واحفظوا أيمانكم كذلك يبين الله لكم آياته لعلكم تشكرون
en: Allah will not punish you for what is unintentional in your oaths, but He will punish you for your deliberate oaths; for its expiation feed ten Masakin (poor persons), on a scale of the average of that with which you feed your own families, or clothe them or manumit a slave. But whosoever cannot afford (that), then he should fast for three days. That is the expiation for the oaths when you have sworn . And protect your oaths (i.e. do not swear much) . Thus Allah make clear to you His Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) that you may be grateful.

source: يا أيها الذين آمنوا إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان فاجتنبوه لعلكم تفلحون
en: O you who believe! Intoxicants (all kinds of alcoholic drinks), and gambling, and Al-Ansab , and Al-Azlam (arrows for seeking luck or decision) are an abomination of Shaitan's (Satan) handiwork. So avoid (strictly all) that (abomination) in order that you may be successful.

source: إنما يريد الشيطان أن يوقع بينكم العداوة والبغضاء في الخمر والميسر ويصدكم عن ذكر الله وعن الصلاة فهل أنتم منتهون
en: Shaitan (Satan) wants only to excite enmity and hatred between you with intoxicants (alcoholic drinks) and gambling, and hinder you from the remembrance of Allah and from As-Salat (the prayer). So, will you not then abstain?

source: وأطيعوا الله وأطيعوا الرسول واحذروا فإن توليتم فاعلموا أنما على رسولنا البلاغ المبين
en: And obey Allah and the Messenger (Muhammad صلى الله عليه وسلم), and beware (of even coming near to drinking or gambling or Al-Ansab, or Al-Azlam, etc.) and fear Allah. Then if you turn away, you should know that it is Our Messenger's duty to convey (the Message) in the clearest way.

source: ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا إذا ما اتقوا وآمنوا وعملوا الصالحات ثم اتقوا وآمنوا ثم اتقوا وأحسنوا والله يحب المحسنين
en: Those who believe and do righteous good deeds, there is no sin on them for what they ate (in the past), if they fear Allah (by keeping away from His forbidden things), and believe and do righteous good deeds, and again fear Allah and believe, and once again fear Allah and do good deeds with Ihsan (perfection). And Allah loves the good-doers.

source: يا أيها الذين آمنوا ليبلونكم الله بشيء من الصيد تناله أيديكم ورماحكم ليعلم الله من يخافه بالغيب فمن اعتدى بعد ذلك فله عذاب أليم
en: O you who believe! Allah will certainly make a trial of you with something in (the matter of) the game that is well within the reach of your hands and your lances, that Allah may test him who fears Him unseen. Then whoever transgresses thereafter, for him there is a painful torment.

source: يا أيها الذين آمنوا لا تقتلوا الصيد وأنتم حرم ومن قتله منكم متعمدا فجزاء مثل ما قتل من النعم يحكم به ذوا عدل منكم هديا بالغ الكعبة أو كفارة طعام مساكين أو عدل ذلك صياما ليذوق وبال أمره عفا الله عما سلف ومن عاد فينتقم الله منه والله عزيز ذو انتقام
en: O you who believe! Kill not the game while you are in a state of Ihram [for Hajj or 'Umrah (pilgrimage)], and whosoever of you kills it intentionally, the penalty is an offering, brought to the Ka'bah, of an eatable animal (i.e. sheep, goat, cow) equivalent to the one he killed, as adjudged by two just men among you; or, for expiation, he should feed Masakin (poor persons), or its equivalent in Saum (fasting), that he may taste the heaviness (punishment) of his deed. Allah has forgiven what is past, but whosoever commits it again, Allah will take retribution from him. And Allah is All-Mighty, All-Able of Retribution.

source: أحل لكم صيد البحر وطعامه متاعا لكم وللسيارة وحرم عليكم صيد البر ما دمتم حرما واتقوا الله الذي إليه تحشرون
en: Lawful to you is (the pursuit of) water-game and its use for food - for the benefit of yourselves and those who travel, but forbidden is (the pursuit of) land-game as long as you are in a state of Ihram (for Hajj or 'Umrah). And fear Allah to Whom you shall be gathered back.

source: جعل الله الكعبة البيت الحرام قياما للناس والشهر الحرام والهدي والقلائد ذلك لتعلموا أن الله يعلم ما في السماوات وما في الأرض وأن الله بكل شيء عليم
en: Allah has made the Ka'bah, the Sacred House, an asylum of security and benefits (e.g.Hajj and 'Umrah) for mankind, and also the Sacred Month and the animals of offerings and the garlanded (people or animals marked with the garlands on their necks made from the outer part of the stem of the Makkah trees for their security), that you may know that Allah has knowledge of all that is in the heavens and all that is in the earth, and that Allah is the All-Knower of each and everything.

source: اعلموا أن الله شديد العقاب وأن الله غفور رحيم
en: Know that Allah is Severe in punishment and that Allah is Oft-Forgiving, Most Merciful.

source: ما على الرسول إلا البلاغ والله يعلم ما تبدون وما تكتمون
en: The duty of the Messenger [i.e. Our Messenger Muhammad صلى الله عليه وسلم whom We have sent to you, (O mankind)] is nothing but to convey (the Message). And Allah knows all that you reveal and all that you conceal.

source: قل لا يستوي الخبيث والطيب ولو أعجبك كثرة الخبيث فاتقوا الله يا أولي الألباب لعلكم تفلحون
en: Say (O Muhammad صلى الله عليه وسلم): "Not equal are Al-Khabith (all that is evil and bad as regards things, deeds, beliefs, persons and foods) and At-Taiyyib (all that is good as regards things, deeds, beliefs, persons, foods), even though the abundance of Al-Khabith may please you." So fear Allah , O men of understanding in order that you may be successful.

source: يا أيها الذين آمنوا لا تسألوا عن أشياء إن تبد لكم تسؤكم وإن تسألوا عنها حين ينزل القرآن تبد لكم عفا الله عنها والله غفور حليم
en: O you who believe! Ask not about things which, if made plain to you, may cause you trouble. But if you ask about them while the Qur'an is being revealed, they will be made plain to you. Allah has forgiven that, and Allah is Oft-Forgiving, Most Forbearing.

source: قد سألها قوم من قبلكم ثم أصبحوا بها كافرين
en: Before you, a community asked such questions, then on that account they became disbelievers.

source: ما جعل الله من بحيرة ولا سائبة ولا وصيلة ولا حام ولكن الذين كفروا يفترون على الله الكذب وأكثرهم لا يعقلون
en: Allah has not instituted things like Bahirah , or Sa'ibah , or Wasilah , or Ham , (all these animals were liberated in honour of idols as practised by pagan Arabs in the pre-Islamic period). But those who disbelieve invent lies against Allah, and most of them have no understanding.
